xml2груминг/Documents/ЗаписьКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗаписьКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаОказана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

xml2груминг/Documents/ЗаписьКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УслугаНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуга.ТекущиеДанные;  
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Сумма = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Номенклатура,Неопределено);
	Иначе
		СтрокаТЧ.Сумма = 0;		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ПроверкаОказанияУслуги=Документы.ЗаписьКлиента.ПроверитьОказаниеУслуг(Объект.Ссылка);
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.УслугаОказана = Ложь; 
	ИначеЕсли ПроверкаОказанияУслуги <> Ложь Тогда
		Объект.УслугаОказана = Истина; 
	Иначе
		Объект.УслугаОказана = Ложь; 

	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда

		Если Параметры.Свойство("Начало") Тогда 
		Объект.ДатаЗаписи = Параметры.Начало;
		КонецЕсли;

		Если Параметры.Свойство("Окончание") Тогда
		Объект.ДатаОкончанияЗаписи = Параметры.Окончание;
		КонецЕсли;

		Если Параметры.Свойство("Сотрудник") Тогда
		Объект.Сотрудник = Параметры.Сотрудник;
		КонецЕсли;

		Если ЗначениеЗаполнено(Объект.ДатаЗаписи) Тогда
		Объект.Дата = НачалоДня(Объект.ДатаЗаписи);
		КонецЕсли;    

	КонецЕсли;

	УстановитьДоступностьЭлементовФормы()	
	


КонецПроцедуры       

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
    Если НЕ РольДоступна("Администратор") Тогда
        Элементы.УслугаОказана.ТолькоПросмотр = Истина;
    КонецЕсли;        
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    Оповестить("Записан заказ");
КонецПроцедуры
